tests/suite-root-url-test/30000-conc-1000/ab_report.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.0.14 (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        10.0.0.14
Server Port:            80

Document Path:          /
Document Length:        547 bytes

Concurrency Level:      1000
Time taken for tests:   334.660 seconds
Complete requests:      30000
Failed requests:        4559
   (Connect: 0, Receive: 0, Length: 4559, Exceptions: 0)
Non-2xx responses:      4559
Keep-Alive requests:    30000
Total transferred:      23864016 bytes
HTML transferred:       14221680 bytes
Requests per second:    89.64 [#/sec] (mean)
Time per request:       11155.329 [ms] (mean)
Time per request:       11.155 [ms] (mean, across all concurrent requests)
Transfer rate:          69.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.2      0      25
Processing:   233 10373 9671.8   7991  127738
Waiting:      233 10373 9671.8   7991  127738
Total:        233 10374 9671.9   7991  127738

Percentage of the requests served within a certain time (ms)
  50%   7991
  66%  11499
  75%  14513
  80%  16735
  90%  20593
  95%  24497
  98%  36260
  99%  45893
 100%  127738 (longest request)